/* Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.
m = 3, n = 4.

0,5 7 -2 -0,2
1 -3,3 8 -9,9
8 7,8 -7,1 9
*/

//получить размерность массива с консоли
int GetNumber(string message)
{
    int result;
    while (true)
    {
        System.Console.WriteLine(message);

        if (int.TryParse(Console.ReadLine(), out result) && result > 0)
        {
            break;
        }
        else
        {
            System.Console.WriteLine("Vveli nevernye danniye. Vvedite korrektnoe chislo");
        }
    }
    return result;
}

//инициализация элементов матрицы случайными числами
double[,] InitMatrix(int m, int n)
{
    double[,] matrix = new double[m, n];
    double minValue = -100;
    double maxValue = 100;
    Random randObj = new Random();
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i, j] = Math.Round(randObj.NextDouble() * (maxValue - minValue) + minValue, 2);
        }  
    }
    return matrix;
}

//распечатать массив на консоль
void PrintMatrix(double[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            System.Console.Write($"{matrix[i, j]} ");
        }
        System.Console.WriteLine();
    }
    System.Console.WriteLine();
}

double[,] resultMatrix = InitMatrix(GetNumber("Введите размерность строк m: "), GetNumber("Введите размерность столбцов n: "));
PrintMatrix(resultMatrix);